In [66]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
df = pd.read_csv('food_order.csv')
df.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24

# Data Cleaning

In [5]:
# Handling missing data
# Replace 'Not given' in the 'rating' column with mean and convert to numeric

df['rating'] = pd.to_numeric(df['rating'].replace('Not given', np.nan))
mean_rating = df['rating'].mean()
df['rating'] = df['rating'].fillna(mean_rating).round(1)
df['rating']

0       4.3
1       4.3
2       5.0
3       3.0
4       4.0
       ...
1893    5.0
1894    5.0
1895    4.3
1896    5.0
1897    4.3
Name: rating, Length: 1898, dtype: float64

In [6]:
# converting day of the week column to categorical variable
df['day_of_the_week'] = df['day_of_the_week'].astype('category')

In [7]:
df.dtypes

order_id                    int64
customer_id                 int64
restaurant_name            object
cuisine_type               object
cost_of_the_order         float64
day_of_the_week          category
rating                    float64
food_preparation_time       int64
delivery_time               int64
dtype: object

In [8]:
# Checking null values
df.isnull().sum()

order_id                 0
customer_id              0
restaurant_name          0
cuisine_type             0
cost_of_the_order        0
day_of_the_week          0
rating                   0
food_preparation_time    0
delivery_time            0
dtype: int64

In [9]:
# Checking Duplicate values
df.duplicated().sum()

0

In [10]:
# Statistics of the numeric columns
summary_stats = df.drop(columns = ['order_id', 'customer_id']).describe()
summary_stats

       cost_of_the_order       rating  food_preparation_time  delivery_time
count        1898.000000  1898.000000            1898.000000    1898.000000
mean           16.498851     4.327081              27.371970      24.161749
std             7.483812     0.580471               4.632481       4.972637
min             4.470000     3.000000              20.000000      15.000000
25%            12.080000     4.000000              23.000000      20.000000
50%            14.140000     4.300000              27.000000      25.000000
75%            22.297500     5.000000              31.000000      28.000000
max            35.410000     5.000000              35.000000      33.000000

In [11]:
df['restaurant_name'].str.replace(r'[^a-zA-Z0-9\s]', '', regex=True)

0                                   Hangawi
1                 Blue Ribbon Sushi Izakaya
2                               Cafe Habana
3                 Blue Ribbon Fried Chicken
4                          Dirty Bird to Go
                       ...
1893    Chipotle Mexican Grill 199 Delivery
1894                              The Smile
1895                      Blue Ribbon Sushi
1896                       Jacks Wife Freda
1897                      Blue Ribbon Sushi
Name: restaurant_name, Length: 1898, dtype: object

In [12]:
df1 = df

In [13]:
df1.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,4.3,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,4.3,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5.0,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3.0,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4.0,25,24

In [14]:
# Converting into csv file and downloading the cleaned dataset
df1.to_csv('cleaned_dataset1.csv', index = False)

In [15]:
df1.to_csv(r'C:\Users\ujwal\python programs\cleaned_dataset1.csv', index = False)

In [16]:
df1.columns

Index(['order_id', 'customer_id', 'restaurant_name', 'cuisine_type',
       'cost_of_the_order', 'day_of_the_week', 'rating',
       'food_preparation_time', 'delivery_time'],
      dtype='object')

In [17]:
df2 = pd.read_csv('cleaned_dataset2.csv')
df2.head()

,order_id,customer_id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,4.3,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,4.3,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5.0,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3.0,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4.0,25,24

In [18]:
# No. of Unique Restaurants
df1['restaurant_name'].nunique()

178

In [19]:
# Popular cuisine
df['cuisine_type'].value_counts()

cuisine_type
American          584
Japanese          470
Italian           298
Chinese           215
Mexican            77
Indian             73
Middle Eastern     49
Mediterranean      46
Thai               19
French             18
Southern           17
Korean             13
Spanish            12
Vietnamese          7
Name: count, dtype: int64

In [20]:
# Popular Restaurant
df['restaurant_name'].value_counts()

restaurant_name
Shake Shack                  219
The Meatball Shop            132
Blue Ribbon Sushi            119
Blue Ribbon Fried Chicken     96
Parm                          68
                            ...
Sushi Choshi                   1
Dos Caminos Soho               1
La Follia                      1
Philippe Chow                  1
'wichcraft                     1
Name: count, Length: 178, dtype: int64

In [21]:
# Sales based on day of the week
df['day_of_the_week'].value_counts()

day_of_the_week
Weekend    1351
Weekday     547
Name: count, dtype: int64

In [22]:
# Total cost per cuisine
df.groupby('cuisine_type')['cost_of_the_order'].sum()

cuisine_type
American          9530.78
Chinese           3505.62
French             356.29
Indian            1235.14
Italian           4892.77
Japanese          7663.13
Korean             182.02
Mediterranean      711.84
Mexican           1303.85
Middle Eastern     922.21
Southern           328.11
Spanish            227.93
Thai               364.95
Vietnamese          90.18
Name: cost_of_the_order, dtype: float64

In [74]:
# Average Delivery time based on day of the week
df.groupby('day_of_the_week')['delivery_time'].mean().reset_index()

C:\Users\ujwal\AppData\Local\Temp\ipykernel_61844\3626185462.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('day_of_the_week')['delivery_time'].mean().reset_index()

  day_of_the_week  delivery_time
0         Weekday      28.340037
1         Weekend      22.470022